package model.stories;

/**
 * Created by Christena on 6/18/2016.
 */
public class Stories {
    public static final String AL_HAKIM="جامع الحاكم بأمر الله: جوهرة إسلامية عمرها أكثر من 1000 عام\n" +
            "بداية البناء\n" +
            "بدأ بناء جامع الحاكم في عهد الخليفة العزيز بالله خارج باب الفتوح القديم سنة 380هـ/ 990م، وسماه جامع الخطبة، ثم أطلق عليه الجامع الأنور لفترة من الزمن، وأتم العزيز جانباً كبيراً من بناء الجامع وخطب فيه وصلى الجمعة في الرابع من رمضان سنة 381 هـ/ 991م، وتوفي قبل أن يكتمل البناء.\n" +
            "ولما تولى ابنه الحاكم بأمر الله الخلافة أمر وزيره يعقوب بن كلس أن يتم بناء الجامع، وانتهى البناء سنة 403هـ /1013م، ولما أعاد الوزير بدر الجمالي بناء سور القاهرة الشمالي في أيام المستنصر أدخل الجامع في نطاق السور.\n" +
            "الوصف المعماري\n" +
            "يقول صلاح الناظر، الباحث الأثري الحر، إن جامع الحاكم يقع في أول شارع المعز لدين الله، وهو ملاصق لباب الفتوح ويحمل رقم 15 أثر، إنشاء الجامع 380هـ/ 990م، ويبلغ طول الجامع من الداخل 120.5م وعرضه 113مترًا، يتوسط الجامع صحن كبير مكشوف تحيط به أربعة أروقة ترتكز عقودها على دعائم، أما المئذنة فهي من الحجر، ويتكون إيوان القبلة من خمسة أروقة بكل رواق 17 عقداً، أما الإيوانات الأخرى فكل منها يتكون من ثلاثة أروقة، ويغطى الأروقة سقف من الخشب.\n" +
            "وأضاف الناظر “وفي نهاية واجهته الشمالية الغربية توجد مئذنتان يحيط بكل منهما قاعدة مربعة ضخمة على شكل هرم ناقص، وتتركب كل قاعدة من مكعبين يعلو أحدهما الآخر، المكعب السفلي يرجع الى عصر إنشاء الجامع، أما المكعب العلوي فيرجع إلى أعمال التجديد والإصلاح التي نفذها بيبرس الجاشنكير سنة 1303م”.\n" +
            "وتابع “يوجد المدخل الرئيسي للجامع بين المئذنتين، وهو أول مدخل بارز في مساجد القاهرة، ويغطي المدخل قبو أسطواني، وفي نهاية المدخل باب عرضه 2.20م، وعلى يمين ويسار المدخل زخارف دقيقة بارتفاع حوالي 1.50م 2، وما يلفت النظر في جامع الحاكم جمال الزخارف وتطور الكتابة الكوفية في شريط الكتابة الذي يسير تحت السقف وعلى المئذنتين وفيما بقى من النوافذ الصغيرة الموجودة في القبة التي تعلو المحراب، ويعتبر جامع الحاكم ثاني مساجد القاهرة اتساعًا بعد جامع أحمد بن طولون، وقد تأثر الجامع بالزلزال الذي حدث سنة 702هـ /1303م فتهدمت كثير من العقود والأكتاف، وسقط السقف وهوت قمتا المئذنتين”.\n" +
            "وأوضح أن السلطان الناصر محمد في ولايته الثانية أمر أحد أمرائه وهو بيبرس الجاشنكير فور وقوع الزلزال بإصلاح الجامع وإعادة بناء ما تهدم منه وتدعيم المئذنتين، فتم ذلك سنة 1303م، كما جدده السلطان حسن سنة 1359م”.\n" +
            "ولفت إلى أن “جامع الحاكم تعرض للعديد من الكوارث، منها أنه لما استولى الصليبيون على القاهرة سنة 1167م حولوا جانبًا منه إلى كنيسة، وفي زمن الحملة الفرنسية تحول إلى مقر لإحدى حاميات الحملة، وفي أوائل القرن 19 نزل فيه بعض المهاجرين الشوام، وأقاموا فيه مناسج للحرير ومصانع للزجاج، ثم حولته وزارة الأوقاف إلى مخزن، حتى تولته لجنة حفظ الآثار العربية”.\n" +
            "وأشار إلى أن أهم أعمال الإصلاح والتجديد بجامع الحاكم هي التي قام بها السيد عمر مكرم نقيب الأشراف سنة 1808، فقد جدد أربعة أروقة بالإيوان الشرقي وجعلها مسجدًا للصلاة، وكسا القبلة بالرخام ووضع بجوارها منبرًا، وفي سنة 1927 قامت لجنة حفظ الآثار العربية بإصلاح أكتاف النصف الغربي من الرواق الجنوبي وعقوده، وأعادت بناء المجاز القاطع لإيوان القبلة، كما نزعت كسوة الرخام التي وضعها السيد عمر مكرم على القبلة، فظهر المحراب القديم.\n" +
            "وكشف أن جامع الحاكم بصورته الحالية من التجديد يرجع إلى أعمال الإصلاح والتجديد التي قامت بها طائفة البهرة الهندية في الثمانينيات.\n" +
            "ظهور الحجارة في العمارة الفاطمية\n" +
            "وأكد “الناظر” أنه لم تظهر الحجارة في العمارة الفاطمية إلا عند بناء جامع الحاكم، وبذلك أصبح يمكن الاستغناء عن الاستعانةبالطلاء “الجصي” في غطاء المسطحات الجدارية وتسويتها، وأضافت الزخرفة المنحوتة على الحجارة أهمية على واجهات المساجد الفاطمية، فظهرت بوضوح في جامعي الأقمر والصالح طلائع، ويلاحظ أن مساحة المساجد في العصر الفاطمي التي بنيت بعد جامع الحاكم أخذت في التقلص، ويرجع ذلك إلى كثرة وتعدد المساجد الجامعة.\n";
}
